# SketchNotEmpty Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ProfileFailures..::..SketchNotEmpty Property
BuiltInFailures..::..ProfileFailures Class See Also
---
Can't move the Profile Plane because the Profile Sketch is not empty. This operation is not supported at this time.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SketchNotEmpty { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SketchNotEmpty As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SketchNotEmpty {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ProfileFailures Class
Autodesk.Revit.DB Namespace